Revit 2027 API
FillPattern.HostOrientation Property
 Orientation to host layer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FillPatternHostOrientation HostOrientation { get; set; }
Public Property HostOrientation As FillPatternHostOrientation
	Get
	Set
public:
property FillPatternHostOrientation HostOrientation {
	FillPatternHostOrientation get ();
	void set (FillPatternHostOrientation value);
}
member HostOrientation : FillPatternHostOrientation with get, set
Property Value
FillPatternHostOrientation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
FillPattern Class
Autodesk.Revit.DB Namespace